Revit 2026 API

# CurveLoop Properties

---

The CurveLoop type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace